grflost/views/grf/_form.php

SELECT "id" AS "id", "description" AS "name" FROM "reference" WHERE "table_relation"='grf_type'
---
                'url'=>Url::to(['/grf/type'])
            ]
        ];
            $out = Reference::find()->select('id as id,description as name')->asArray()->andWhere(['table_relation' => ['grf_type']])->all();

SELECT * FROM "reference" WHERE "table_relation"='requestor'
SELECT * FROM "vendor"
---
        echo $form->field($model, 'grf_type')->widget(DepDrop::classname(), $depdropUnit);
    ?>

	<?= $form->field($model, 'requestor')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Reference::find()->andWhere(['table_relation' => ['requestor']])->all(), 'id','description'),
        'language' => 'en',
        // form-control select2-hidden-accessible
        'options' => ['placeholder' => 'Select '.$model->getAttributeLabel('requestor'), 'class' => 'input-sm' ,'id' => 'requestor_id'],
        'pluginOptions' => [
        'allowClear' => true],
        ]) ?>
    <div class="vendor">
        <?= $form->field($model, 'id_vendor')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(Vendor::find()->all(), 'id','name'),
            'language' => 'en',
            // form-control select2-hidden-accessible
            'options' => ['placeholder' => 'Select Vendor', 'class' => 'input-sm', 'id'=>'vendor_id'],
            'pluginOptions' => [
            'allowClear' => true],
            ]) ?>

SELECT * FROM "division" WHERE "id"=1
SELECT * FROM "region"
SELECT * FROM "labor"
SELECT * FROM "reference" WHERE "table_relation"='team_name'
---

    <?= $form->field($model->idDivision, 'nama')->textInput(['disabled'=>true]) ?>

    <?= $form->field($model, 'id_region')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Region::find()->all(), 'id','name'),
        'language' => 'en',
        // form-control select2-hidden-accessible
        'options' => ['placeholder' => 'Select '.$model->getAttributeLabel('id_region'), 'class' => 'input-sm'],
        'pluginOptions' => [
        'allowClear' => true],
        ]) ?>

    <?= $form->field($model, 'team_leader')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Labor::find()->all(), 'nik','nama'),
        'language' => 'en',
        // form-control select2-hidden-accessible
        'options' => ['placeholder' => 'Select Leader', 'class' => 'input-sm'],
        'pluginOptions' => [
        'allowClear' => true],
        ]) ?>

    <?= $form->field($model, 'team_name')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Reference::find()->where(['table_relation'=>'team_name'])->all(), 'id','description'),
        'language' => 'en',
        // form-control select2-hidden-accessible
        'options' => ['placeholder' => 'Select Team', 'class' => 'input-sm'],
        'pluginOptions' => [
        'allowClear' => true],
        ]) ?>