grflost/views/grf/indexothers.php

function getFilterGrf(){
    $list = ArrayHelper::map(Reference::find()->where(['table_relation'=>'grf_type'])->all(),'id', 'description');
---
SELECT * FROM "reference" WHERE "table_relation"='grf_type'