grflost/views/grf/view.php

			]) ?>
		</div>
		<div class="col-sm-6">
			<?= DetailView::widget([
				'model' => $model,
				'options' => ['class' => 'small table table-striped table-bordered detail-view'],
				'template' => '<tr><th{captionOptions}>{label}</th><td{contentOptions}>{value}</td></tr>',
				'attributes' => [
					[
                        'attribute' => 'id_division',
                        'value' => function($model){
                            return $model->idDivision->nama;
                        },
                    ],
                    [
						'attribute' => 'team_name',
						'value' => function($model){
							if($model->teamName)
							return $model->teamName->description;
						},
						'filter' => Arrayhelper::map(Reference::find()->andWhere(['table_relation' => 'team_name'])->all(), 'id', 'description'),
					],
					[
						'attribute' => 'requestor',
						'value' => function($model){
							return $model->requestorName->description;
						},
						'filter' => Arrayhelper::map(Reference::find()->andWhere(['table_relation' => 'requestor'])->all(), 'id', 'description'),
					],

                    [
                        'attribute' => 'id_region',
                        'value' => function($model){
                            return Region::find()->andWhere(['id' => $model->id_region])->one()->name;
                        },
                    ],
                    [
                        'attribute' => 'team_leader',
                        'value' => function($model){
                        	if($model->team_leader)
                            return Labor::find()->andWhere(['nik' => $model->team_leader])->one()->nama;
                        },
                    ],
---
SELECT * FROM "reference" WHERE "id"=19
SELECT * FROM "division" WHERE "id"=1
SELECT * FROM "reference" WHERE "id"=58
SELECT * FROM "reference" WHERE "table_relation"='team_name'
SELECT * FROM "reference" WHERE "id"=21
SELECT * FROM "reference" WHERE "table_relation"='requestor'
SELECT * FROM "region" WHERE "id"=5
SELECT * FROM "labor" WHERE "nik"='1233214'

                            }
                        },
                    ],
                    [
                        'attribute' => 'verified_by',
                        'label' => 'Verified By',
                        'value' => function ($model){
                            if ( is_numeric($model->verified_by) ){
                                return User::findOne($model->verified_by)->name;
                            }
                        },
                        'visible' => ($model->status_listing > 3),
                    ],
---
SELECT * FROM "user" WHERE "id"=5