grflost/views/grf/view.php

SELECT * FROM "reference" WHERE "id"=19
SELECT * FROM "labor" WHERE 0=1
---
			]) ?>
		</div>
		<div class="col-sm-6">
			<?= DetailView::widget([
				'model' => $model,
				'options' => ['class' => 'small table table-striped table-bordered detail-view'],
				'template' => '<tr><th{captionOptions}>{label}</th><td{contentOptions}>{value}</td></tr>',
				'attributes' => [
                    [
						'attribute' => 'team_name',
						'value' => function($model){
							return $model->teamName->description;
						},
						'filter' => Arrayhelper::map(Reference::find()->andWhere(['table_relation' => 'team_name'])->all(), 'id', 'description'),
					],
					[
						'attribute' => 'requestor',
						'value' => function($model){
							return $model->requestorName->description;
						},
						'filter' => Arrayhelper::map(Reference::find()->andWhere(['table_relation' => 'requestor'])->all(), 'id', 'description'),
					],

                    [
                        'attribute' => 'id_region',
                        'value' => function($model){
                            return Region::find()->andWhere(['id' => $model->id_region])->one()->name;
                        },
                    ],
                    [
                        'attribute' => 'team_leader',
                        'value' => function($model){
                            return Labor::find()->andWhere(['nik' => $model->team_leader])->one()->nama;
                        },
                    ],