common/widgets/Email.php

SELECT "username", "email", "id_user" FROM "user_auth" WHERE "child"='/grf/indexapprove' GROUP BY "username", "email", "id_user"
---
    public function sendEmail($arrAuth, $header, $subject, $idwarehouse = NULL)
    {
		$users = UserAuth::find()->select(['username','email', 'id_user'])->where(['child'=>$arrAuth])->groupBy(['username','email'])->all();