grflost/controllers/GrfController.php

SELECT * FROM "grf" WHERE "id"='305'
---
    protected function findModel($id)
    {
        if (($model = Grf::findOne($id)) !== null) {