grflost/controllers/GrfController.php

SELECT COUNT(*) FROM "grf" WHERE ("grf_number" LIKE '%/2018') AND ("id_modul"=4)
SELECT EXISTS(SELECT * FROM "grf" WHERE ("grf_number"=57) AND ("id_modul"=4))
---
    public function actionCreate()
    {
		$this->layout = 'blank';
        $model = new Grf();
        $model->scenario='create';
		$model->id_modul = $this->id_modul;
		$model->id_warehouse = 2;
		$model->status_return = 31;
		$model->id_division = Yii::$app->user->identity->id_division;
		$newidinst = Grf::find()->andWhere(['and',['like', 'grf_number', '%/'.date('Y'), false],['id_modul' => $model->id_modul]])->count() + 1;
		$newidinstexist = Grf::find()->andWhere(['and',['grf_number' => $newidinst],['id_modul' => $model->id_modul]])->exists();

SELECT "orafin_code" FROM "grf_detail" WHERE "id_grf"=338
---

		}

		$modelDetail = GrfDetail::find()->select(['orafin_code'])->where(['id_grf' => $idGrf])->all();

SELECT * FROM "grf" WHERE "id"='358'
---
    protected function findModel($id)
    {
        if (($model = Grf::findOne($id)) !== null) {