grflost/controllers/GrfController.php

SELECT EXISTS(SELECT * FROM "grf" WHERE ("id"=228))
---
    public function actionCreate()
    {
		$this->layout = 'blank';
        $model = new Grf();
        $model->scenario='create';
		$model->id_modul = $this->id_modul;
		$model->id_warehouse = 2;
		$model->status_return = 31;
		$model->id_division = Yii::$app->user->identity->id_division;
		$newidinst = Grf::find()->andWhere(['and',['like', 'grf_number', '%/'.date('Y'), false],['id_modul' => $model->id_modul]])->count() + 1;
		$newidinstexist = Grf::find()->andWhere(['and',['grf_number' => $newidinst],['id_modul' => $model->id_modul]])->exists();
		$newidinst++;

		$monthroman = Numbertoroman::convert(date('n'));

		$model->grf_number = sprintf("%04d", $newidinst).'/GRF-IC1/WT/'.$monthroman.date('/Y');

        if ($model->load(Yii::$app->request->post())) {

SELECT EXISTS(SELECT * FROM "grf" WHERE ("id"=366))
---
    public function actionCreateothers()
    {
		$this->layout = 'blank';
        $model = new Grf();
        $model->scenario='createothers';
		$model->id_modul = $this->id_modul;
		$model->id_warehouse = 2;
		$model->status_return = 31;
		$model->id_division = Yii::$app->user->identity->id_division;
		$newidinst = Grf::find()->andWhere(['and',['like', 'grf_number', '%/'.date('Y'), false],['id_modul' => $model->id_modul]])->count() + 1;
		$newidinstexist = Grf::find()->andWhere(['and',['grf_number' => $newidinst],['id_modul' => $model->id_modul]])->exists();
		$newidinst++;

		$monthroman = Numbertoroman::convert(date('n'));

		$model->grf_number = sprintf("%04d", $newidinst).'/GRF-IC1/WT/'.$monthroman.date('/Y');

        if ($model->load(Yii::$app->request->post())) {

SELECT * FROM "grf" WHERE "id"='227'
---
	public function actionUpdatedetail($idDetail)
    {
        $this->layout = 'blank';
        $modelDetail = GrfDetail::find()->andWhere(['id' => $idDetail])->one();

        $id   = $modelDetail->orafin_code;
        $val  = $modelDetail->qty_request;

        $data[$id] = $val;

       	Yii::$app->session->set('idGrf', $modelDetail->id_grf);

       	if ($modelDetail->load(Yii::$app->request->post())) {

SELECT * FROM "grf" WHERE "id"='235'
---
	public function actionSubmit($id){
		$model = Grf::findOne($id);